<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0d704e8e5392227d016ee4db1e69bb7451b48142999172e9dc7a2b290869394a","plan_job_ref":"Job Plan Airflow DAGs #450 at https://github.com/cal-itp/data-infra/actions/runs/16790635584","plan_out_hash":"9d0a3fb51d9a6815c954fd3d12de3bbd732fcd0a573ecd2f61312d4e6848f3d1","plan_hash":"208f616470bd68d0d97fa97da80f0f61fba98413d328919fba79b179dbc08408","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["macros/incremental_max_date.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/macros/incremental_max_date.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/macros/incremental_max_date.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/_int_gtfs.yaml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "rwMIMA==" -> (known after apply)
!~      detect_md5hash      = "T07Rr8u8NH1CM9p/qlrCBA==" -> "different hash"
!~      generation          = 1751416668478590 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
!~      md5hash             = "T07Rr8u8NH1CM9p/qlrCBA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "2HOvNA==" -> (known after apply)
!~      detect_md5hash      = "K4vxkantbpF/b938WRKLsQ==" -> "different hash"
!~      generation          = 1754428294308766 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"
!~      md5hash             = "K4vxkantbpF/b938WRKLsQ==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_trip_updates_trip_summaries.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "/6PITQ==" -> (known after apply)
!~      detect_md5hash      = "XEnAEWZpoQOFGcwc4IHHfg==" -> "different hash"
!~      generation          = 1754428294067359 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_trip_summaries.sql"
!~      md5hash             = "XEnAEWZpoQOFGcwc4IHHfg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_trip_summaries.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #450](https://github.com/cal-itp/data-infra/actions/runs/16790635584)